<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Cap&iacute;tulo 4. Construtores e destrutores</title><link rel="stylesheet" type="text/css" href="estilo.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="up" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="prev" href="cha.classes.objetos.html" title="Cap&iacute;tulo 3. Classes e objetos"><link rel="next" href="cha.heranca.html" title="Cap&iacute;tulo 5. Heran&ccedil;a"><meta xmlns:fo="http://www.w3.org/1999/XSL/Format" http-equiv="Content-Type" content="text/html; charset=utf-8"><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/x-mathjax-config">
    MathJax.Hub.Config({
    extensions: ["tex2jax.js"],
    jax: ["input/TeX","output/SVG"],
    tex2jax: {inlineMath: [["$","$"],["\\(","\\)"]]}
    });
  </script><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/javascript" src="/mathjax/MathJax.js"></script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" class="navheader" href="cha.classes.objetos.html">&laquo;</a></td><th colspan="3" align="center" class="navheader">Cap&iacute;tulo 4. Construtores e destrutores</th><td width="20%" align="right">&nbsp;<a accesskey="n" class="navheader" href="cha.heranca.html">&raquo;</a></td></tr></table><hr></div><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="cha.construtores.destrutores"></a>Cap&iacute;tulo 4. Construtores e destrutores</h1></div></div></div><div class="toc"><p><b>&Iacute;ndice</b></p><dl class="toc"><dt><span class="section"><a href="cha.construtores.destrutores.html#sec.construtores.destrutores.default">4.1. Construtor <span class="foreignphrase"><em class="foreignphrase">default</em></span></a></span></dt><dt><span class="section"><a href="cha.construtores.destrutores.html#sec.construtores.destrutores.copia">4.2. Construtor de c&oacute;pia</a></span></dt><dt><span class="section"><a href="cha.construtores.destrutores.html#sec.construtores.destrutores.argumentos">4.3. Construtor com argumentos variados</a></span></dt><dt><span class="section"><a href="cha.construtores.destrutores.html#sec.construtores.destrutores.destrutores">4.4. Destrutores</a></span></dt><dt><span class="section"><a href="cha.construtores.destrutores.html#sec.construtores.destrutores.exercicios">4.5. Exerc&iacute;cios de fixa&ccedil;&atilde;o</a></span></dt></dl></div>
    
    <p>Uma quest&atilde;o importante que pode despertar a aten&ccedil;&atilde;o do programador &eacute; como estabelecer o estado de um determinado objeto assim que este &eacute; criado. Considere, por exemplo, a classe <code class="classname">Vetor2d</code> que vem sendo estudada ao longo do texto. Logo que um objeto dessa classe &eacute; declarado, que valores assumem as vari&aacute;veis <code class="varname">x</code> e <code class="varname">y</code> inicialmente? A priori, pode-se afirmar que s&atilde;o os conte&uacute;dos presentes nas regi&otilde;es de  mem&oacute;ria reservadas para abrigar estas duas vari&aacute;veis. Geralmente, &eacute; praticamente imposs&iacute;vel prever que valores seriam estes. Desse modo, a exist&ecirc;ncia de mecanismos que inicializem as vari&aacute;veis internas do objeto para que seu estado inicial seja previamente conhecido pode ser bastante conveniente.</p>
    <p>Uma solu&ccedil;&atilde;o seria, por exemplo, criar um m&eacute;todo <code class="function">iniciar()</code> que atribu&iacute;sse &agrave;s vari&aacute;veis valores conhecidos (por exemplo, <span class="inlinemediaobject"><span class="phrase">$x=0$</span></span> e <span class="inlinemediaobject"><span class="phrase">$y=0$</span></span>) e disponibiliz&aacute;-lo na interface p&uacute;blica da classe. Sendo assim, cada vez que um objeto da classe fosse criado, o usu&aacute;rio poderia acionar o m&eacute;todo, inicializando o objeto, como sugere o exemplo a seguir.</p>
    <div class="informalexample">
      <pre class="programlisting">Vetor2d v1;
v1.iniciar();</pre>
    </div>
    <p>Entretanto, existem recursos mais elegantes dispon&iacute;veis para os programadores: s&atilde;o os chamados <span class="emphasis"><em>construtores</em></span>. Os construtores s&atilde;o fun&ccedil;&otilde;es especiais padronizadas que podem ser adicionadas a uma classe. Quando existentes, elas s&atilde;o chamadas automaticamente exatamente ap&oacute;s o objeto ser criado, permitindo que o programador defina todos os procedimentos necess&aacute;rios para inicializar o estado do respectivo objeto ap&oacute;s a sua cria&ccedil;&atilde;o. Em outras palavras, eles permitem construir o estado inicial de um objeto.</p>
    <p>Em C++, os construtores s&atilde;o fun&ccedil;&otilde;es que recebem o mesmo nome da classe, podem existir mais de um por classe, e s&atilde;o diferenciados pelo n&uacute;mero e tipos de argumentos. Por exemplo, para a classe <code class="classname">Vetor2d</code>, um dos poss&iacute;veis construtores &eacute; uma fun&ccedil;&atilde;o membro chamada <code class="function">Vetor2d()</code>.</p>
    <p>Suponha que, quando criados da forma mostrada no exemplo, objetos da classe Vetor2d devam assumir em seu estado inicial os valores <span class="inlinemediaobject"><span class="phrase">$(x,y)=(0,0)$</span></span> para as vari&aacute;veis da classe. Para assegurar este comportamento, o construtor da classe deve prever esta funcionalidade, por exemplo, com a defini&ccedil;&atilde;o mostrada no <a class="xref" href="cha.construtores.destrutores.html#exe.construtores.destrutores.construtor" title="Exemplo 4.1. Exemplo de defini&ccedil;&atilde;o de um construtor">Exemplo&nbsp;4.1</a>.</p>
    <div class="example"><a name="exe.construtores.destrutores.construtor"></a><p class="title"><b>Exemplo 4.1. Exemplo de defini&ccedil;&atilde;o de um construtor</b></p><div class="example-contents">
      
      <pre class="programlisting">Vetor2d::Vetor2d(){
  x=<span class="hl-number">0</span>;
  y=<span class="hl-number">0</span>;
}</pre>
    </div></div><br class="example-break">
    <p>Observe que, como outras fun&ccedil;&otilde;es da classe, o construtor tamb&eacute;m possui acesso direto aos membros privados da classe, permitindo a modifica&ccedil;&atilde;o de seus valores.</p>
    <p>Embora atribuir automaticamente valores nulos para as coordenadas do vetor seja bastante conveniente, o cliente da classe pode desejar escolher seus pr&oacute;prios valores, de sorte que o construtor proposto torna-se insuficiente. Para resolver este problema, um novo construtor pode ser criado para receber atrav&eacute;s de dois argumentos passados pelo usu&aacute;rio os valores desejados para as coordenadas do vetor. Uma poss&iacute;vel defini&ccedil;&atilde;o para o novo construtor seria a seguinte:</p>
    <div class="informalexample">
      <pre class="programlisting">Vetor2d::Vetor2d(<strong class="hl-keyword">float</strong> _x=<span class="hl-number">0</span>, <strong class="hl-keyword">float</strong> _y=<span class="hl-number">0</span>){
  x=_x;
  y=_y;
}</pre>
    </div>
    <p>O novo construtor agora recebe as coordenadas pelas vari&aacute;veis <code class="varname">_x</code> e <code class="varname">_y</code>, que s&atilde;o copiadas para as vari&aacute;veis privadas da classe. Veja que os nomes das vari&aacute;veis n&atilde;o s&atilde;o so mesmos declarados na classe, para evitar confus&otilde;es para o compilador. O caractere <span class="foreignphrase"><em class="foreignphrase">underline</em></span> pode ser utilizado no in&iacute;cio de cada vari&aacute;vel que receber&aacute; os par&acirc;metros para evitar a ambiguidade, e ainda identificar a que vari&aacute;vel se deseja atribuir o valor repassado.</p>
    <p>Veja ainda que os par&acirc;metros recebem argumentos <span class="foreignphrase"><em class="foreignphrase">default</em></span>. O argumento default &eacute; um recurso da linguagem C++ que permite atribuir valores automaticamente caso seja omitido o argumento correspondente para a fun&ccedil;&atilde;o chamada. Argumentos <span class="foreignphrase"><em class="foreignphrase">default</em></span> devem ser fornecidos da direita para a esquerda de modo que n&atilde;o se pode prover valores para um argumento default a menos que todos os argumentos &agrave; sua direita tenham valores <span class="foreignphrase"><em class="foreignphrase">default</em></span> tamb&eacute;m atribu&iacute;dos. Exemplo:</p>
    <div class="informalexample">
      <pre class="programlisting">Vetor2d::Vetor2d(<strong class="hl-keyword">float</strong> _x=<span class="hl-number">0</span>, <strong class="hl-keyword">float</strong> _y=<span class="hl-number">0</span>); <em class="hl-comment" style="color: silver">// V&Aacute;LIDO</em>
Vetor2d::Vetor2d(<strong class="hl-keyword">float</strong> _x, <strong class="hl-keyword">float</strong> _y=<span class="hl-number">0</span>); <em class="hl-comment" style="color: silver">// V&Aacute;LIDO</em>
Vetor2d::Vetor2d(<strong class="hl-keyword">float</strong> _x=<span class="hl-number">0</span>, <strong class="hl-keyword">float</strong> _y);   <em class="hl-comment" style="color: silver">// INV&Aacute;LIDO</em></pre>
    </div>
    <p>Assim, a classe <code class="classname">Vetor2d</code> pode ser redefinida da seguinte da seguinte forma usando um construtor como mostra o exemplo a seguir. Procure recompilar o c&oacute;digo anterior, incluindo modifica&ccedil;&otilde;es para testar o construtor e verifique os efeitos produzidos. </p>
    <div class="informalexample"><a name="exe.classevetor.classes.vetor2d.hpp"></a>
      <pre class="programlisting">#ifndef VETOR2D_HPP
<span class="hl-directive" style="color: maroon">#define VETOR2D_HPP</span>

<strong class="hl-keyword">class</strong> Vetor2d{
<strong class="hl-keyword">private</strong>:
  <strong class="hl-keyword">float</strong> x, y;
<strong class="hl-keyword">public</strong>:
  Vetor2d(<strong class="hl-keyword">float</strong> _x=<span class="hl-number">0</span>, <strong class="hl-keyword">float</strong> _y=<span class="hl-number">0</span>){
    x=_x; y=_y;
  }
  <strong class="hl-keyword">void</strong> setX(<strong class="hl-keyword">float</strong> _x);
  <strong class="hl-keyword">float</strong> getX(<strong class="hl-keyword">void</strong>);
  <strong class="hl-keyword">void</strong> setY(<strong class="hl-keyword">float</strong> _y);
  <strong class="hl-keyword">float</strong> getY(<strong class="hl-keyword">void</strong>);
};

<span class="hl-directive" style="color: maroon">#endif</span>

	</pre>
    </div>
    <p>A cria&ccedil;&atilde;o de um objeto sempre &eacute; feita pela invoca&ccedil;&atilde;o de seus m&eacute;todos construtores. Sempre que uma fun&ccedil;&atilde;o membro possui o mesmo nome da classe, ela &eacute; considerada um construtor. Tr&ecirc;s tipos de construtores podem ser identificados em um programa escrito em C++: o construtor <span class="foreignphrase"><em class="foreignphrase">default</em></span>, o construtor de c&oacute;pia, e o construtor com argumentos variados. Quando um construtor n&atilde;o &eacute; fornecido pelo programador, o pr&oacute;prio compilador oferece uma implementa&ccedil;&atilde;o, que &eacute; inserida automaticamente no c&oacute;digo gerado.</p>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.construtores.destrutores.default"></a>4.1. Construtor <span class="foreignphrase"><em class="foreignphrase">default</em></span></h2></div></div></div>
      
      <p>O primeiro deles &eacute; um construtor sem argumentos, que &eacute; chamado toda vez que um objeto &eacute; criado sem argumentos. Um construtor <span class="foreignphrase"><em class="foreignphrase">default</em></span> normalmente &eacute; disponibilizados pelo compilador, na aus&ecirc;ncia de uma implementa&ccedil;&atilde;o fornecida pelo usu&aacute;rio. Normalmente, os construtores desse tipo n&atilde;o possuem argumentos. Entretanto, um construtor onde todos os argumentos recebem valores <span class="foreignphrase"><em class="foreignphrase">default</em></span> tamb&eacute;m &eacute; considerado um construtor <span class="foreignphrase"><em class="foreignphrase">default</em></span>. Somente pode haver um desses construtores para cada classe, pois a inclus&atilde;o de mais de um causa confus&atilde;o durante o processo de escolha pelo compilador. Alguns exemplos de construtores s&atilde;o mostrados no <a class="xref" href="cha.construtores.destrutores.html#exe.construtor.default" title="Exemplo 4.2. Exemplos de construtores default">Exemplo&nbsp;4.2</a>.</p>
      <div class="example"><a name="exe.construtor.default"></a><p class="title"><b>Exemplo 4.2. Exemplos de construtores default</b></p><div class="example-contents">
	
	<pre class="programlisting"><strong class="hl-keyword">class</strong> Alo{
  <strong class="hl-keyword">int</strong> x;
  <strong class="hl-keyword">public</strong>:
  Alo(){ x=<span class="hl-number">0</span>; }
};

<strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
  Alo x;
}</pre>
	<pre class="programlisting"><strong class="hl-keyword">class</strong> Alo{
  <strong class="hl-keyword">int</strong> x;
  <strong class="hl-keyword">public</strong>:
  Alo(<strong class="hl-keyword">int</strong> _x=<span class="hl-number">0</span>){ x=_x;}
};

<strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
  Alo x;
}</pre>
      </div></div><br class="example-break">
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.construtores.destrutores.copia"></a>4.2. Construtor de c&oacute;pia</h2></div></div></div>
      
      <p>O segundo tipo de construtor &eacute; o construtor de c&oacute;pia. Ele &eacute; usado quando se deseja criar um novo objeto com as caracter&iacute;sticas de um outro que &eacute; passado como refer&ecirc;ncia na forma de um par&acirc;metro. Considere o exemplo a seguir.</p>
      <div class="informalexample">
	<pre class="programlisting">#include &lt;iostream&gt;

<strong class="hl-keyword">using</strong> <strong class="hl-keyword">namespace</strong> std;

<strong class="hl-keyword">class</strong> Alo{
  <strong class="hl-keyword">int</strong> x;
<strong class="hl-keyword">public</strong>:
  Alo(<strong class="hl-keyword">int</strong> _x=<span class="hl-number">0</span>){ 
    cout &lt;&lt; <strong class="hl-string"><em style="color:red">"construtor default\n"</em></strong>;
    x= _x;
    print();
  }
  Alo(Alo &amp;a){
    cout &lt;&lt; <strong class="hl-string"><em style="color:red">"construtor copia\n"</em></strong>;
    x = a.x;
    print();
  }
  <strong class="hl-keyword">void</strong> print(){
    cout &lt;&lt; <strong class="hl-string"><em style="color:red">"x = "</em></strong> &lt;&lt; x &lt;&lt; <strong class="hl-string"><em style="color:red">"\n"</em></strong>;
  }
};

<strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
  Alo x;
  Alo y(<span class="hl-number">1</span>);
  Alo z = x;
  Alo w = y;
  Alo k(y); <em class="hl-comment" style="color: silver">// mesmo que Alo k = y; !</em>
}

	  </pre>
      </div>
      <p>Quando compilado, o exemplo acima produz o seguinte resultado.</p>
      <pre class="screen"><code class="computeroutput">construtor default
x = 0
construtor default
x = 1
construtor copia
x = 0
construtor copia
x = 1
construtor copia
x = 1
      </code></pre>
      <p>As duas primeiras instancia&ccedil;&otilde;es da classe <code class="classname">Alo</code> chamam diretamente o construtor <span class="foreignphrase"><em class="foreignphrase">default</em></span>. Na primeira instancia&ccedil;&atilde;o a chamada do construtor n&atilde;o recebe argumentos, de sorte que o valor <span class="foreignphrase"><em class="foreignphrase">default</em></span> para a vari&aacute;vel <code class="varname">x</code> &eacute; assumido. Na segunda, um valor inteiro &eacute; repassado, que por sua vez &eacute; armazenado na vari&aacute;vel.</p>
      <p>Na terceira instancia&ccedil;&atilde;o da classe <code class="classname">Alo</code>, a vari&aacute;vel <code class="varname">z</code> &eacute; criada. Desta vez, a atribui&ccedil;&atilde;o de igualdade &agrave; vari&aacute;vel <code class="varname">x</code> faz com que o segundo construtor seja chamado. Neste construtor, &eacute; poss&iacute;vel observar uma nova forma de passagem de argumentos: a passagem por refer&ecirc;ncia. A passagem de argumentos por refer&ecirc;ncia &eacute; identificada pelo uso do <span class="symbol">&amp;</span> precedendo o nome da vari&aacute;vel. Observe a <a class="xref" href="cha.construtores.destrutores.html#fig.passagem-referencia" title="Figura 4.1. Passagem de par&acirc;metros por refer&ecirc;ncia">Figura&nbsp;4.1</a>. A vari&aacute;vel <code class="varname">y</code> pertencente &agrave; fun&ccedil;&atilde;o <code class="function">main()</code> assume o valor 3 , que &eacute; armazenado em uma posi&ccedil;&atilde;o de mem&oacute;ria destinada para ela. Entretanto, sob a &oacute;tica da fun&ccedil;&atilde;o <code class="function">funcao()</code> esta mesma posi&ccedil;&atilde;o de mem&oacute;ria onde o inteiro 3 est&aacute; armazenado &eacute; vista como sendo a vari&aacute;vel <code class="varname">x</code>. Dessa maneira, uma vari&aacute;vel &eacute; declarada em um local e referenciada em outra usando um nome diferente.</p>
      <div class="figure"><a name="fig.passagem-referencia"></a><p class="title"><b>Figura 4.1. Passagem de par&acirc;metros por refer&ecirc;ncia</b></p><div class="figure-contents">
	
	<div class="mediaobject" align="center"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figs/referencia.svg">figs/referencia.svg</object></div></div>
      </div></div><br class="figure-break">
      <p>Embora a sintaxe das refer&ecirc;ncias possa ser mais simples e transparente que a sintaxe de ponteiros, nem sempre podem ser usadas. Por exemplo, refer&ecirc;ncias n&atilde;o podem receber outros valores uma vez que s&atilde;o inicializadas (ponteiros podem); as refer&ecirc;ncias nunca podem ser nulas, embora os ponteiros possam ser. Via de regra, deve-se preferir o uso de refer&ecirc;ncias, escolhendo o uso de ponteiros somente se necess&aacute;rio for.</p>
      <p>Construtores de c&oacute;pia geralmente s&atilde;o escolhidos quando se precisa alocar recursos dispon&iacute;veis al&eacute;m da defini&ccedil;&atilde;o da pr&oacute;pria classe, por exemplo, em opera&ccedil;&otilde;es que envolvem aloca&ccedil;&atilde;o din&acirc;mica de mem&oacute;ria, manipula&ccedil;&atilde;o de arquivos e acesso a recursos do sistema operacional. Assim, al&eacute;m de realizar a c&oacute;pia direta de vari&aacute;veis alocadas estaticamente, o construtor de c&oacute;pia dever&aacute; gerenciar os problemas de aloca&ccedil;&atilde;o de recursos para o novo objeto.</p>
      <p>Construtores de c&oacute;pia possuem ainda uma classifica&ccedil;&atilde;o adicional. Podem ser chamados de construtores de c&oacute;pia rasa ou profunda, conforme os procedimentos de aloca&ccedil;&atilde;o de recursos que realizam. Por exemplo, se apenas a c&oacute;pia membro-a-membro de um objeto para outro &eacute; realizada, diz-se que &eacute; feita uma <span class="emphasis"><em>c&oacute;pia rasa</em></span> do objeto. Entretanto, se recursos adicionais s&atilde;o alocados, ent&atilde;o uma <span class="emphasis"><em>c&oacute;pia profunda</em></span> &eacute; realizada. </p>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.construtores.destrutores.argumentos"></a>4.3. Construtor com argumentos variados</h2></div></div></div>
      
      <p>Quaisquer outros construtores que n&atilde;o se enquadrem nas duas categorias previamente descritas podem s&atilde;o construtores com argumentos variados. Neste caso, fica a cargo do programador especificar quantidade e tipos de argumentos que ser&atilde;o fornecidos ao construtor.</p>

      <div class="example"><a name="exe.construtor.argumentos"></a><p class="title"><b>Exemplo 4.3. Exemplos de construtores com argumentos variados</b></p><div class="example-contents">
	
	<pre class="programlisting"><strong class="hl-keyword">class</strong> Alo{
  <strong class="hl-keyword">int</strong> x;
  <strong class="hl-keyword">public</strong>:
  Alo(<strong class="hl-keyword">float</strong> z, <strong class="hl-keyword">int</strong> w){}
};

<strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
  Alo x(<span class="hl-number">5.8</span>,-<span class="hl-number">3</span>);
}</pre>
      </div></div><br class="example-break">
      <p>&Eacute; importante lembrar que o que difere um construtor de outro s&atilde;o os seus argumentos, uma vez que o nome da fun&ccedil;&atilde;o construtor &eacute; exatamente a mesma. Sendo assim, deve-se tomar cuidado para evitar declara&ccedil;&otilde;es que causem confus&atilde;o para o compilador, como mostra o exemplo seguinte:</p>
      <div class="informalexample">
	<pre class="programlisting"><strong class="hl-keyword">class</strong> Alo{
  <strong class="hl-keyword">int</strong> x;
<strong class="hl-keyword">public</strong>:
  Alo(<strong class="hl-keyword">int</strong> _x=<span class="hl-number">0</span>){ x=_x; } <em class="hl-comment" style="color: silver">// Problema:</em>
  Alo(){ x=<span class="hl-number">0</span>; }          <em class="hl-comment" style="color: silver">// qual dos dois dever&aacute; ser chamado?!</em>
};

<strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
  Alo x;
}</pre>
      </div>
      <p>A sobrecarga (presen&ccedil;a de mais de uma implementa&ccedil;&atilde;o) dos dois construtores &eacute; amb&iacute;gua, de sorte que o compilador apresenta erro durante o processamento do c&oacute;digo.</p>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.construtores.destrutores.destrutores"></a>4.4. Destrutores</h2></div></div></div>
      
      <p>Da mesma forma que os construtores, os destrutores tamb&eacute;m desempenham um processo importante na linguagem C++. Eles s&atilde;o chamados automaticamente quando o objeto est&aacute; para cessar de existir na mem&oacute;ria da m&aacute;quina. Portanto, s&atilde;o considerados um recurso valioso para realizar libera&ccedil;&atilde;o de recursos alocados pelos construtores ou acionar outros mecanismos necess&aacute;rios durante a fase de destrui&ccedil;&atilde;o de um objeto criado.</p>
      <p>Ao contr&aacute;rio dos construtores, que podem existir mais de um, somente um destrutor pode existir, de modo que &eacute; vedado ao programador escolher a fun&ccedil;&atilde;o de destrui&ccedil;&atilde;o, que &eacute; &uacute;nica e n&atilde;o recebe par&acirc;metros. Ela recebe o mesmo nome da classe precedida pelo s&iacute;mbolo <span class="symbol">~</span>, como ilustra o <a class="xref" href="cha.construtores.destrutores.html#exe.construtores.destrutores.destrutor" title="Exemplo 4.4. Exemplo de defini&ccedil;&atilde;o de um destrutor">Exemplo&nbsp;4.4</a>.</p>
      <div class="example"><a name="exe.construtores.destrutores.destrutor"></a><p class="title"><b>Exemplo 4.4. Exemplo de defini&ccedil;&atilde;o de um destrutor</b></p><div class="example-contents">
	
	<pre class="programlisting">#include &lt;iostream&gt;

<strong class="hl-keyword">using</strong> <strong class="hl-keyword">namespace</strong> std;

<strong class="hl-keyword">class</strong> Alo{
<strong class="hl-keyword">public</strong>:
  Alo(){
    cout &lt;&lt; <strong class="hl-string"><em style="color:red">"Construtor de Alo\n"</em></strong>;
  }
  ~Alo(){
    cout &lt;&lt; <strong class="hl-string"><em style="color:red">"Destrutor de Alo\n"</em></strong>;
  }
};

<strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
  Alo x, y;
}

	  </pre>
      </div></div><br class="example-break">
      <p>Quando executado, o <a class="xref" href="cha.construtores.destrutores.html#exe.construtores.destrutores.destrutor" title="Exemplo 4.4. Exemplo de defini&ccedil;&atilde;o de um destrutor">Exemplo&nbsp;4.4</a> produz o seguinte resultado:</p>
      <pre class="screen"><code class="computeroutput">
Construtor de Alo
Destrutor de Alo</code></pre>
      <p>Note que na sequ&ecirc;ncia de chamadas de fun&ccedil;&atilde;o, primeiro ocorre a do construtor e, em seguida, a do destrutor. Para cada objeto, as chamadas sempre ocorrem aos pares, de sorte que seu ciclo de vida sempre envolve a chamada de um construtor na cria&ccedil;&atilde;o e de um destrutor antes do seu fim. Caso o usu&aacute;rio n&atilde;o tenha incluido a fun&ccedil;&atilde;o do destrutor na sua implementa&ccedil;&atilde;o, o pr&oacute;prio compilador se encarrega da tarefa, inserindo uma fun&ccedil;&atilde;o vazia.</p>
      <p>Considere agora um exemplo um pouco mais complexo envolvendo destrutores:</p>
      <div class="informalexample">
	<pre class="programlisting">#include &lt;iostream&gt;

<strong class="hl-keyword">using</strong> <strong class="hl-keyword">namespace</strong> std;

<strong class="hl-keyword">class</strong> Alo{
  <strong class="hl-keyword">int</strong> id;
<strong class="hl-keyword">public</strong>:
  Alo(<strong class="hl-keyword">int</strong> _id){
    id = _id;
    cout &lt;&lt; <strong class="hl-string"><em style="color:red">"Construtor de Alo: elemento "</em></strong> &lt;&lt; id &lt;&lt; <strong class="hl-string"><em style="color:red">"\n"</em></strong>;
  }
  ~Alo(){
    cout &lt;&lt; <strong class="hl-string"><em style="color:red">"Destrutor de Alo: elemento "</em></strong> &lt;&lt; id &lt;&lt; <strong class="hl-string"><em style="color:red">"\n"</em></strong>;
  }
};

<strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
  Alo x(<span class="hl-number">1</span>), y(<span class="hl-number">2</span>), z(<span class="hl-number">3</span>);
}

	  </pre>
      </div>
      <p>A execu&ccedil;&atilde;o do c&oacute;digo apresentado no exemplo acima produz a seguinte sa&iacute;da:</p>
      <pre class="screen"><code class="computeroutput">Construtor de Alo: elemento1
Construtor de Alo: elemento2
Construtor de Alo: elemento3
Destrutor de Alo: elemento3
Destrutor de Alo: elemento2
Destrutor de Alo: elemento1</code></pre>
      <p>Agora, quando mais de um objeto &eacute; criado, a sequ&ecirc;ncia de chamadas de construtores e destrutores evidencia mais uma propriedade importante: a ordem em que os destrutores s&atilde;o chamados. O C++ instaura o processo de destrui&ccedil;&atilde;o autom&aacute;tica primeiro para os objetos criados mais recentementes, partindo ent&atilde;o para os objetos com cria&ccedil;&atilde;o mais antiga. Veja no exemplo acima que a cria&ccedil;&atilde;o de objetos &eacute; feita na sequ&ecirc;ncia <code class="varname">x</code> -&gt; <code class="varname">y</code> -&gt; <code class="varname">z</code>, ao passo que a destrui&ccedil;&atilde;o segue a sequ&ecirc;ncia <code class="varname">z</code> -&gt; <code class="varname">y</code> -&gt; <code class="varname">x</code>.</p>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.construtores.destrutores.exercicios"></a>4.5. Exerc&iacute;cios de fixa&ccedil;&atilde;o</h2></div></div></div>
      
      <div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem">
	  <p>Quais as utilidades dos construtores e destrutores?</p>
	</li><li class="listitem">
	  <p>Modifique a implementa&ccedil;&atilde;o da classe <code class="classname">Point2d</code> criada na se&ccedil;&atilde;o <a class="xref" href="cha.classes.objetos.html#sec.classes.objetos.exercicios" title="3.4. Exerc&iacute;cios de fixa&ccedil;&atilde;o">Se&ccedil;&atilde;o&nbsp;3.4</a> para incluir suporte a inicializa&ccedil;&atilde;o autom&aacute;tica. Que tarefas voc&ecirc; atribuiria a um destrutor designado para esta classe?</p>
	</li><li class="listitem">
	  <p>Crie uma classe denominada <code class="classname">Complexo</code> para armazenar n&uacute;meros complexos com partes reais e imagin&aacute;rias representadas por vari&aacute;veis do tipo <span class="token">float</span>. A classe deve contemplar os seguintes construtores:</p>
	  <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
	      <p>Um construtor para criar n&uacute;meros complexos da forma:</p>
	      <pre class="programlisting">Complexo a;</pre>
	    </li><li class="listitem">
	      <p>Um construtor para criar n&uacute;meros complexos da forma:</p>
	      <pre class="programlisting">Complexo b(<span class="hl-number">4.5</span>, -<span class="hl-number">3.4</span>);</pre>
	    </li><li class="listitem">
	      <p>Um construtor para criar n&uacute;meros complexos da forma:</p>
	      <pre class="programlisting">Complexo c = b;</pre>
	    </li><li class="listitem">
	      <p>Um construtor para criar n&uacute;meros complexos da forma:</p>
	      <pre class="programlisting">Complexo d(b);</pre>
	    </li></ul></div>
	</li><li class="listitem">
	  <p>Prepare uma classe denominada <code class="classname">Matriz</code> capaz de armazenar matrizes bidimensionais alocadas dinamicamente (para tipos de dados <span class="token">float</span>). O projeto da classe fica a seu crit&eacute;rio, lembrando que informa&ccedil;&otilde;es como a largura e a altura da matriz devem ser armazenadas adequadamente em algum lugar, bem como o ponteiro para os elementos da matriz. A classe deve possuir ainda construtores quer permitam criar objetos usando uma das seguintes estrat&eacute;gias:</p>
	  <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"> 
	      <p>Cria&ccedil;&atilde;o de uma matriz de <span class="inlinemediaobject"><span class="phrase">$M \times N$</span></span> elementos. Exemplo:</p>
	      <pre class="programlisting">Matriz A(<span class="hl-number">4</span>,<span class="hl-number">5</span>);</pre>
	    </li><li class="listitem"> 
	      <p>Cria&ccedil;&atilde;o de uma matriz vazia. Exemplo:</p>
	      <pre class="programlisting">Matriz B;</pre>
	    </li><li class="listitem"> 
	      <p>Cria&ccedil;&atilde;o de uma matriz pela c&oacute;pia de outra fornecida. Exemplo:</p>
	      <pre class="programlisting">Matriz C(A);</pre>
	    </li></ul></div>
	  <p>Al&eacute;m disso, a classe tamb&eacute;m dever&aacute; contemplar um destrutor para liberar poss&iacute;veis recursos alocados dinamicamente pelo construtor, uma fun&ccedil;&atilde;o para atribuir valores aos elementos da matriz, bem como uma fun&ccedil;&atilde;o para imprimir a matriz criada.</p>
	  <p>Prepare um programa de para testar a classe que voc&ecirc; fez, explorando todos os recursos que foram implementados.</p>
	</li></ol></div>
    </div>
  </div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navfooter"><hr><table width="100%" class="navfoot" summary="Navigation footer"><tr><th width="40%" align="left"><a accesskey="p" class="navfoot" href="cha.classes.objetos.html">&laquo;&nbsp;Cap&iacute;tulo 3.  Classes e objetos </a>&nbsp;</th><th width="20%" align="center"><a accesskey="h" class="navfoot" href="index.html">&#8657;Principal&#8657;</a></th><th width="40%" align="right">&nbsp;<a accesskey="n" class="navfoot" href="cha.heranca.html">Cap&iacute;tulo 5. Heran&ccedil;a&nbsp;&raquo;</a></th></tr></table></div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><hr><table class="navfoot" width="100%"><tr><td align="center"><p class="copyright">Copyright &copy; 2012 Agostinho Brito</p></td></tr></table></div></body></html>