<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o</title><link rel="stylesheet" type="text/css" href="estilo.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="up" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="prev" href="pre.prefacio.html" title="Pref&aacute;cio"><link rel="next" href="cha.parafernalha.html" title="Cap&iacute;tulo 2. Ferramentas de desenvolvimento"><meta xmlns:fo="http://www.w3.org/1999/XSL/Format" http-equiv="Content-Type" content="text/html; charset=utf-8"><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/x-mathjax-config">
    MathJax.Hub.Config({
    extensions: ["tex2jax.js"],
    jax: ["input/TeX","output/SVG"],
    tex2jax: {inlineMath: [["$","$"],["\\(","\\)"]]}
    });
  </script><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/javascript" src="/mathjax/MathJax.js"></script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" class="navheader" href="pre.prefacio.html">&laquo;</a></td><th colspan="3" align="center" class="navheader">Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o</th><td width="20%" align="right">&nbsp;<a accesskey="n" class="navheader" href="cha.parafernalha.html">&raquo;</a></td></tr></table><hr></div><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="cha.introducao"></a>Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o</h1></div></div></div><div class="toc"><p><b>&Iacute;ndice</b></p><dl class="toc"><dt><span class="section"><a href="cha.introducao.html#sec.introducao.procedural">1.1. Paradigma de programa&ccedil;&atilde;o procedural
      </a></span></dt><dt><span class="section"><a href="cha.introducao.html#sec.introducao.oo">1.2. Paradigma de programa&ccedil;&atilde;o orientada a objetos</a></span></dt><dt><span class="section"><a href="cha.introducao.html#sec.introducao.funcional-logico">1.3. Paradigmas de programa&ccedil;&atilde;o funcional e l&oacute;gico</a></span></dt></dl></div>
    
    <p>Desde que come&ccedil;aram a se espalhar, as linguagens de programa&ccedil;&atilde;o v&ecirc;m acompanhando de perto a evolu&ccedil;&atilde;o do <span class="foreignphrase"><em class="foreignphrase">hardware</em></span> em que operam. As primeiras linguagens que surgiram por a&iacute; foram projetadas para dispositivos bem mais modestos que o seu telefone celular. Em verdade, possu&iacute;am limita&ccedil;&otilde;es de mem&oacute;ria e velocidade nos sistemas da &eacute;poca. A arquitetura dos antigos processadores for&ccedil;ava os pioneiros a realizar verdadeiros malabarismos para implementar programas que hoje conseguimos desenvolver com grande facilidade em equipamentos baratos comprados na loja da esquina. Para leitores curiosos e com tempo livre, vale a pena gastar alguns minutos lendo sobre a <a class="ulink" href="http://en.wikipedia.org/wiki/History_of_programming_languages" target="_top">Hist&oacute;ria da programa&ccedil;&atilde;o</a> e ver as dificuldades enfrentadas pelos nossos antepassados.</p>
    <p>Se olharmos para os programas de computador criados no passado e compararmos com os criados no presente, n&atilde;o &eacute; muito dif&iacute;cil concluir que &eacute; preciso cada vez mais esfor&ccedil;o para conseguir prosperar na &aacute;rea de programa&ccedil;&atilde;o de computadores. Antigamente, a oferta de desenvolvedores de <span class="foreignphrase"><em class="foreignphrase"> software </em></span> e de ferramentas de desenvolvimento era bem mais escassa. Hoje, com a dissemina&ccedil;&atilde;o dos meios de educa&ccedil;&atilde;o em massa, de ferramentas de desenvolvimento gratuitas e de mecanismos eficientes para comercializa&ccedil;&atilde;o de programas de computador, est&aacute; bem mais dif&iacute;cil encontrar compradores para programas do tipo <span class="emphasis"><em>"hello, world!"</em></span>.</p>
    <p>As consequ&ecirc;ncias naturais da evolu&ccedil;&atilde;o do mercado de programas de computador s&atilde;o o aumento de complexidade dos sistemas criados e do n&uacute;mero de profissionais envolvidos no desenvolvimento das ferramentas.</p>
    <p>O uso de tecnologias apropriadas para gerenciar o caos nestas situa&ccedil;&otilde;es &eacute; imprescind&iacute;vel para quem quer se enveredar na &aacute;rea. Alunos com forma&ccedil;&atilde;o espec&iacute;fica em Ci&ecirc;ncias da Computa&ccedil;&atilde;o s&atilde;o adestrados desde cedo para aprender importantes conceitos de engenharia de software que os ajudam a organizar as partes de um sistema complexo, de modo a torn&aacute;-lo gerenci&aacute;vel. Entretanto, cursos de engenharia possuem um foco bem diferenciado, mais voltado para o aprendizado da matem&aacute;tica, da f&iacute;sica e da qu&iacute;mica. </p>
    <p>Para este p&uacute;blico, o aprendizado dos paradigmas de orienta&ccedil;&atilde;o a objeto e as funcionalidades de uma linguagem orientada a objetos pode ser um diferencial no mercado de trabalho. Grande parte das ferramentas de desenvolvimento profissionais oferecem amplos recursos de orienta&ccedil;&atilde;o a objetos, facilitando a modelagem e a an&aacute;lise de sistemas bem mais complexos que o belo e simples <span class="emphasis"><em>"hello, world!"</em></span>.</p>
    <p>Existem diversas linguagens de programa&ccedil;&atilde;o capazes de realizar tarefas de seu interesse no computador. As linguagens de programa&ccedil;&atilde;o podem ser classificada de acordo com a forma como o programador especifica o problema a ser resolvido, ou seja, conforme o paradigma de programa&ccedil;&atilde;o suportado pela linguagem.</p>
    <p>Provavelmente, o paradigma mais conhecido &eacute; o procedural (presente na linguagem de programa&ccedil;&atilde;o C), mas h&aacute; outras op&ccedil;&otilde;es tamb&eacute;m dispon&iacute;veis por a&iacute;, capazes de permitir a solu&ccedil;&atilde;o de algumas classes de problemas de forma mais eficiente. Em todo caso, os paradigmas de programa&ccedil;&atilde;o mais comuns s&atilde;o os seguintes:</p>
    <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
	<p>Procedural</p>
      </li><li class="listitem">
	<p>Funcional</p>
      </li><li class="listitem">
	<p>L&oacute;gico</p>
      </li><li class="listitem">
	<p>Orientado a objeto</p>
      </li></ul></div>
    <p>Cada um desses paradigmas ser&aacute; brevemente apresentado nas se&ccedil;&otilde;es seguintes, ilustrando classes de problema cada um se aplica.</p>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.introducao.procedural"></a>1.1. Paradigma de programa&ccedil;&atilde;o procedural
      </h2></div></div></div>
      
      <p>O paradigma de programa&ccedil;&atilde;o procedural geralmente &eacute; o preferido dos iniciantes. Foi um dos primeiros paradigmas de programa&ccedil;&atilde;o adotados, pois permitia (e ainda permite) que diversos algoritmos, principalmente aqueles que envolviam computa&ccedil;&atilde;o num&eacute;rica, fossem criados com relativa facilidade.</p>
      <p>Para o ensino da programa&ccedil;&atilde;o, o paradigma procedural facilita a introdu&ccedil;&atilde;o aos alunos dos conceitos b&aacute;sicos de concep&ccedil;&atilde;o de algoritmos, de entrada e sa&iacute;da de dados e de tratamento de mem&oacute;ria. Tais conceitos s&atilde;o normalmente tratados em cursos introdut&oacute;rios de programa&ccedil;&atilde;o para alunos de engenharia e normalmente atendem &agrave;s exig&ecirc;ncias curriculares da maioria dos cursos.</p>
      <p>Programas de computador escritos em linguagens que seguem este paradigma geralmente s&atilde;o compostos por um conjunto de m&oacute;dulos (ou fun&ccedil;&otilde;es), cada um realizando uma determinada parte do processo. Cada programa &eacute; composto de uma rotina principal e diversas subrotinas auxiliares, sendo dada &ecirc;nfase principal &agrave; ordem dos eventos no sistema desenvolvido, conforme ilustrado na <a class="xref" href="cha.introducao.html#fig.paradigma-procedural" title="Figura 1.1. Paradigma de programa&ccedil;&atilde;o procedural">Figura&nbsp;1.1</a>. </p>
      <div class="figure"><a name="fig.paradigma-procedural"></a><p class="title"><b>Figura 1.1. Paradigma de programa&ccedil;&atilde;o procedural</b></p><div class="figure-contents">
	
	<div class="mediaobject" align="center"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figs/paradigma-procedural.svg">figs/paradigma-procedural.svg</object></div></div>
      </div></div><br class="figure-break">
      <p>Normalmente, linguagens puramente procedurais oferecem um melhor controle do fluxo do c&oacute;digo e s&atilde;o mais f&aacute;ceis de entender. Como o foco &eacute; dado na sequ&ecirc;ncia de eventos, elas geralmente s&atilde;o bastante comuns nas comunidades que lidam com a concep&ccedil;&atilde;o e implementa&ccedil;&atilde;o de algoritmos num&eacute;ricos. As bibliotecas mais difundidas para uso em computa&ccedil;&atilde;o num&eacute;rica s&atilde;o escritas em linguagens procedurais como C ou FORTRAN.</p>
    </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.introducao.oo"></a>1.2. Paradigma de programa&ccedil;&atilde;o orientada a objetos</h2></div></div></div>
      
      <p>Na programa&ccedil;&atilde;o orientada a objetos, um programa de computador &eacute; visto como um conjunto de agentes que colaboram de modo a realizar um problema. Nesta filosofia de programa&ccedil;&atilde;o, a &ecirc;nfase &eacute; dada forma como os agentes que causam as a&ccedil;&otilde;es ou que est&atilde;o sujeitos &agrave;s a&ccedil;&otilde;es de outros agentes. Os programas de computador s&atilde;o formados por um conjunto de entidades (objetos) que trocam mensagens entre si.</p>
	<p>A xml:id&eacute;ia de um programa desenvolvido sob a &oacute;tica do paradigma de programa&ccedil;&atilde;o orientada a objetos &eacute; ilustrada na <a class="xref" href="cha.introducao.html#fig.paradigma-oo" title="Figura 1.2. Paradigma de programa&ccedil;&atilde;o orientada a objetos">Figura&nbsp;1.2</a>.</p>
	<div class="figure"><a name="fig.paradigma-oo"></a><p class="title"><b>Figura 1.2. Paradigma de programa&ccedil;&atilde;o orientada a objetos</b></p><div class="figure-contents">
	  
	  <div class="mediaobject" align="center"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="graphic"><object type="image/svg+xml" data="figs/paradigma-oo.svg">figs/paradigma-oo.svg</object></div></div>
	</div></div><br class="figure-break">  
	<p>As linguagens que suportam orienta&ccedil;&atilde;o a objetos oferecem uma grande vantagem para o programador: permitir a separa&ccedil;&atilde;o de dados e procedimentos de forma mais evidente. Esta caracter&iacute;stica permite, entre outras coisas, que o programador desenvolva os m&oacute;dulos de sua aplica&ccedil;&atilde;o atenuando a &aacute;rdua tarefa de lidar com o tr&aacute;fego de informa&ccedil;&atilde;o entre fun&ccedil;&otilde;es.</p>
      </div>
      <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.introducao.funcional-logico"></a>1.3. Paradigmas de programa&ccedil;&atilde;o funcional e l&oacute;gico</h2></div></div></div>
	
	<p>A desenvolver...</p>
      </div>
  </div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navfooter"><hr><table width="100%" class="navfoot" summary="Navigation footer"><tr><th width="40%" align="left"><a accesskey="p" class="navfoot" href="pre.prefacio.html">&laquo;&nbsp;Pref&aacute;cio</a>&nbsp;</th><th width="20%" align="center"><a accesskey="h" class="navfoot" href="index.html">&#8657;Principal&#8657;</a></th><th width="40%" align="right">&nbsp;<a accesskey="n" class="navfoot" href="cha.parafernalha.html">Cap&iacute;tulo 2. Ferramentas de desenvolvimento&nbsp;&raquo;</a></th></tr></table></div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><hr><table class="navfoot" width="100%"><tr><td align="center"><p class="copyright">Copyright &copy; 2012 Agostinho Brito</p></td></tr></table></div></body></html>