<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Pref&aacute;cio</title><link rel="stylesheet" type="text/css" href="estilo.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="up" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="prev" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="next" href="cha.introducao.html" title="Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o"><meta xmlns:fo="http://www.w3.org/1999/XSL/Format" http-equiv="Content-Type" content="text/html; charset=utf-8"><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/x-mathjax-config">
    MathJax.Hub.Config({
    extensions: ["tex2jax.js"],
    jax: ["input/TeX","output/SVG"],
    tex2jax: {inlineMath: [["$","$"],["\\(","\\)"]]}
    });
  </script><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/javascript" src="/mathjax/MathJax.js"></script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" class="navheader" href="index.html">&laquo;</a></td><th colspan="3" align="center" class="navheader">Pref&aacute;cio</th><td width="20%" align="right">&nbsp;<a accesskey="n" class="navheader" href="cha.introducao.html">&raquo;</a></td></tr></table><hr></div><div class="preface"><div class="titlepage"><div><div><h1 class="title"><a name="pre.prefacio"></a>Pref&aacute;cio</h1></div></div></div>
    
    <p> Esta introdu&ccedil;&atilde;o &agrave; programa&ccedil;&atilde;o em linguagem C++ foi desenvolvida com foco no ensino de orienta&ccedil;&atilde;o a objetos em cursos de engenharia. Tais cursos geralmente demandam apenas conhecimentos b&aacute;sicos da linguagem, dadas as limita&ccedil;&otilde;es de tempo impostas nos curr&iacute;culos e a carga de outras disciplinas presentes nos curr&iacute;culos. Empestar de conte&uacute;dos mais avan&ccedil;ados em programa&ccedil;&atilde;o a rotina de futuros engenheiros pode sobrecarregar a audi&ecirc;ncia e colocar o p&uacute;blico para correr.</p>
    <p> Visando deixar os alunos motivados, procuramos encher este material apenas com ferramentas simples e &uacute;teis que servir&atilde;o para tocarem atividades acad&ecirc;micas e profissionais na &aacute;rea de engenharia. N&atilde;o espere se tornar um especialista em C++ ap&oacute;s resolver todos os exerc&iacute;cios propostos. Apenas a pr&aacute;tica constante lhe dar&aacute; experi&ecirc;ncia para identificar as melhores estrat&eacute;gias de programa&ccedil;&atilde;o para resolver os problemas que poder&atilde;o surgir.</p>
    <p> Embora existam outras linguagens que tamb&eacute;m possam servir para o ensino de orienta&ccedil;&atilde;o objetos, a escolha pela linguagem C++ se d&aacute; por uma forte raz&atilde;o: problemas de engenharia que envolvem programa&ccedil;&atilde;o geralmente est&atilde;o relacionados a aplica&ccedil;&atilde;o de m&eacute;todos num&eacute;ricos ou intera&ccedil;&atilde;o com dispositivos eletro-eletr&ocirc;nicos. Como estas duas searas normalmente envolvem a necessidade de computa&ccedil;&atilde;o performante ou interface com outras linguagens de baixo n&iacute;vel (por exemplo, Assembly), a linguagem C geralmente &eacute; a preferida nessas ocasi&otilde;es. Logo, a escolha imediata da linguagem C++ para realizar intera&ccedil;&otilde;es de alto n&iacute;vel &eacute; bem atrativa para tais programadores. </p>
    <p> Ser&atilde;o apresentados ao leitor conceitos rudimentares de orienta&ccedil;&atilde;o a objetos em C++, construtores e destrutores, aloca&ccedil;&atilde;o din&acirc;mica de mem&oacute;ria, heran&ccedil;a, polimorfismo, classes abstratas, tratamento de exce&ccedil;&otilde;es, sobrecarga de operadores e de fun&ccedil;&otilde;es. Apresentamos tamb&eacute;m alguns recursos da biblioteca padr&atilde;o de gabaritos STL (<a class="ulink" href="http://www.sgi.com/tech/stl" target="_top">www.sgi.com/tech/stl</a>), uma esp&eacute;cie de canivete su&iacute;co em algoritmos e estruturas de dados. Acreditamos que tais conceitos s&atilde;o razo&aacute;veis para alunos de engenharia que desejam se aventurar nos meandros da programa&ccedil;&atilde;o em C++. </p>
    <p> Os exemplos apresentados no texto foram testados com sucesso em um sistema Linux.</p>
  </div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navfooter"><hr><table width="100%" class="navfoot" summary="Navigation footer"><tr><th width="40%" align="left"><a accesskey="p" class="navfoot" href="index.html">&laquo;&nbsp;Programa&ccedil;&atilde;o Orientada a Objetos em C++</a>&nbsp;</th><th width="20%" align="center"><a accesskey="h" class="navfoot" href="index.html">&#8657;Principal&#8657;</a></th><th width="40%" align="right">&nbsp;<a accesskey="n" class="navfoot" href="cha.introducao.html">Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o&nbsp;&raquo;</a></th></tr></table></div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><hr><table class="navfoot" width="100%"><tr><td align="center"><p class="copyright">Copyright &copy; 2012 Agostinho Brito</p></td></tr></table></div></body></html>