<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Cap&iacute;tulo 2. Ferramentas de desenvolvimento</title><link rel="stylesheet" type="text/css" href="estilo.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="up" href="index.html" title="Programa&ccedil;&atilde;o Orientada a Objetos em C++"><link rel="prev" href="cha.introducao.html" title="Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o"><link rel="next" href="cha.classes.objetos.html" title="Cap&iacute;tulo 3. Classes e objetos"><meta xmlns:fo="http://www.w3.org/1999/XSL/Format" http-equiv="Content-Type" content="text/html; charset=utf-8"><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/x-mathjax-config">
    MathJax.Hub.Config({
    extensions: ["tex2jax.js"],
    jax: ["input/TeX","output/SVG"],
    tex2jax: {inlineMath: [["$","$"],["\\(","\\)"]]}
    });
  </script><script xmlns:fo="http://www.w3.org/1999/XSL/Format" type="text/javascript" src="/mathjax/MathJax.js"></script><script xmlns:fo="http://www.w3.org/1999/XSL/Format">
      (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
      
      ga('create', 'UA-41839650-1', 'area8.dca.ufrn.br');
      ga('send', 'pageview');
      
    </script></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" class="navheader" href="cha.introducao.html">&laquo;</a></td><th colspan="3" align="center" class="navheader">Cap&iacute;tulo 2. Ferramentas de desenvolvimento</th><td width="20%" align="right">&nbsp;<a accesskey="n" class="navheader" href="cha.classes.objetos.html">&raquo;</a></td></tr></table><hr></div><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="cha.parafernalha"></a>Cap&iacute;tulo 2. Ferramentas de desenvolvimento</h1></div></div></div><div class="toc"><p><b>&Iacute;ndice</b></p><dl class="toc"><dt><span class="section"><a href="cha.parafernalha.html#d5e76">2.1. Preparando o ecossistema de desenvolvimento</a></span></dt><dt><span class="section"><a href="cha.parafernalha.html#sec.parafernalha.ambiente-exemplo-descricao">2.2. Descri&ccedil;ao do programa <code class="filename">testa-ambiente.cpp</code></a></span></dt></dl></div>
    
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e76"></a>2.1. Preparando o ecossistema de desenvolvimento</h2></div></div></div>
      
      <p>Como toda linguagem de programa&ccedil;&atilde;o, programas em C++ precisam ser editados de alguma forma. O c&oacute;digo-fonte desenvolvido em C++ deve ser armazenado na forma de texto simples. A princ&iacute;pio, qualquer editor de texto pode ser usado para editar C++. N&atilde;o h&aacute; problemas em editar seus programas no Word ou BrOffice. Entretanto, a comodidade de usar um ambiente de desenvolvimento integrado para criar aplica&ccedil;&otilde;es &eacute; incontest&aacute;vel. Ambientes integrados permitem, por exemplo, real&ccedil;ar com cores o c&oacute;digo escrito, deixando mais agrad&aacute;vel a tarefa de programa&ccedil;&atilde;o. Ambientes integrados s&atilde;o capazes de automatizar o processo de organiza&ccedil;&atilde;o e compila&ccedil;&atilde;o do c&oacute;digo-fonte, focando a aten&ccedil;&atilde;o do programador no desenvolvimento de algoritmos.</p>
    <p>Sendo assim, o passo zero para o aprendizado da linguagem &eacute; preparar seu computador com as ferramentas necess&aacute;rias para editar e compilar programas escritos em C++.</p>
    <p>A prop&oacute;sito, C++ &eacute; uma linguagem compilada, de sorte que necessita de uma ferramenta para processar os arquivos que cont&eacute;m c&oacute;digo C++ e gerar um programa execut&aacute;vel. Outros tipos de linguagens podem ser interpretadas, necessitando de um programa que leia as instru&ccedil;&otilde;es e as execute, sem gerar um programa execut&aacute;vel (Ex: Python), ou meio l&aacute;, meio c&aacute;, um h&iacute;brido de compila&ccedil;&atilde;o com interpreta&ccedil;&atilde;o, como &eacute; a proposta da linguagem Java. Entretanto, deixamos essas discuss&otilde;es para outras esferas no aprendizado de linguagens de programa&ccedil;&atilde;o.</p>
    <p>Na qualidade de usu&aacute;rio de sistemas Unix, fico acanhado em sugerir um ambiente de programa&ccedil;&atilde;o descente para usu&aacute;rios Windows. Dos que j&aacute; mantive contato, o <a class="ulink" href="http://www.bloodshed.net/devcpp.html" target="_top"> Dev-C++</a> &eacute; uma op&ccedil;&atilde;o interessante, embora acredite que devam existir outras mais atraentes.</p>
    <p>Em ecossistemas Unix, por outro lado, existem v&aacute;rias op&ccedil;&otilde;es de ambientes de desenvolvimento de c&oacute;digo em C++ e todas elas geralmente s&atilde;o integradas ao compilador mais popular na comunidade livre: o <a class="ulink" href="http://gcc.gnu.org/" target="_top">GCC/G++</a>. Nesta linha, podem ser sugeridas algumas op&ccedil;&otilde;es de ambientes que possam interessar aos programadores: <a class="ulink" href="www.eclipse.org" target="_top">eclipse</a>, <a class="ulink" href="http://netbeans.org/" target="_top">netbeans</a>, <a class="ulink" href="http://kdevelop.org/" target="_top">KDevelop</a> e <a class="ulink" href="http://qt.nokia.com/products/developer-tools" target="_top">Qt Creator</a>. N&atilde;o d&aacute; para afirmar qual deles &eacute; o melhor para escolher, pois geralmente a comodidade do usu&aacute;rio normalmente &eacute; o fator mais preponderante. O que muda basicamente de uma proposta para outra (do ponto de vista de um usu&aacute;rio iniciante) &eacute; o apelo visual e funcionalidades de integra&ccedil;&atilde;o com o sistema em que o usu&aacute;rio desenvolve. A maior parte das tarefas de edi&ccedil;&atilde;o de texto e c&oacute;digo realizo usando o bom e velho <a class="ulink" href="www.gnu.org/s/emacs/" target="_top">emacs</a> e compilo os arquivos gerados em um terminal atrav&eacute;s de linhas de comando. Quando h&aacute; necessidade de desenvolver aplicativos com interface gr&aacute;fica em C++, fa&ccedil;o uso da biblioteca QT (<a class="ulink" href="http://qt.nokia.com/" target="_top">http://qt.nokia.com</a>) e utilizo o Qt Creator para escrever c&oacute;digo e integrar comodamente toda a cria&ccedil;&atilde;o.</p>
    <p>Programa simples desenvolvidos em C++ puro geralmente fazem uso de terminais para exibir os resultados produzidos, inclusive no sistema operacional Windows. Certifique-se apenas de que seu ecossistema consegue compilar o c&oacute;digo mostrado no <a class="xref" href="cha.parafernalha.html#exe.parafernalha.ambiente.exemplo" title="Exemplo 2.1. Programa testa-ambiente.cpp para testar sua ferramenta de desenvolvimento.">Exemplo&nbsp;2.1</a> e mostrar o resultado em algum lugar vis&iacute;vel, preferncialmente em um terminal de texto. No sistema operacional Windows, o terminal &eacute; mais conhecido como Prompt de Comando.</p>
    <p>Este exemplo simples cont&eacute;m poucas mas importantes instru&ccedil;&otilde;es que deveriam ser entendidas e compiladas no seu ambiente de desenvolvimento. Se n&atilde;o for poss&iacute;vel compilar este c&oacute;digo ou visualizar o resultado, talvez seja interessante reconsiderar a sua escolha.</p>
    <div class="example"><a name="exe.parafernalha.ambiente.exemplo"></a><p class="title"><b>Exemplo 2.1. Programa <a class="ulink" href="exemplos/testa-ambiente.cpp" target="_top"><code class="filename">testa-ambiente.cpp</code></a> para testar sua ferramenta de desenvolvimento.</b></p><div class="example-contents">
      
      <pre class="programlisting">#include &lt;iostream&gt;

<strong class="hl-keyword">using</strong> <strong class="hl-keyword">namespace</strong> std;

<strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
  <strong class="hl-keyword">char</strong> s[<span class="hl-number">40</span>];
  cout &lt;&lt; <strong class="hl-string"><em style="color:red">"Digite seu nome: "</em></strong>;
  cin &gt;&gt; s;
  cout &lt;&lt; <strong class="hl-string"><em style="color:red">"Seu nome eh"</em></strong> &lt;&lt; s &lt;&lt; <strong class="hl-string"><em style="color:red">"\n"</em></strong>;
  <strong class="hl-keyword">return</strong> <span class="hl-number">0</span>;
}

	</pre>
    </div></div><br class="example-break">
    <p>O programa do <a class="xref" href="cha.parafernalha.html#exe.parafernalha.ambiente.exemplo" title="Exemplo 2.1. Programa testa-ambiente.cpp para testar sua ferramenta de desenvolvimento.">Exemplo&nbsp;2.1</a> pode ser compilado e executado em um terminal Linux a partir das seguintes linhas de comando:</p>
    <pre class="screen"><code class="prompt">$</code> <span class="command"><strong>g++</strong></span> testa-ambiente.cpp <code class="option">-o</code> testa-ambiente
<code class="prompt">$</code> <span class="command"><strong>./testa-ambiente</strong></span>
<code class="computeroutput">
Digite seu nome: <strong class="userinput"><code>Jose</code></strong>
Seu nome &eacute; Jose
</code></pre>
  </div>
    <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="sec.parafernalha.ambiente-exemplo-descricao"></a>2.2. Descri&ccedil;ao do programa <code class="filename">testa-ambiente.cpp</code></h2></div></div></div>
      
      <p>O programa inicia com uma diretiva de inclus&atilde;o que insere para processamento o arquivo <code class="filename">iostream</code>. A diretiva <span class="token">#include</span> instrui o compilador a usar um pr&eacute;-processador que l&ecirc; e processa o arquivo referenciado antes de processar o restante do programa.</p>
      <div class="informalexample">
	<pre class="programlisting">#include &lt;iostream&gt;</pre>
      </div>
      <p>O arquivo <code class="filename">iostream</code> cont&eacute;m elementos importantes para a lide com a entrada e a sa&iacute;da de dados padr&atilde;o. Entenda-se como entrada e sa&iacute;da padr&atilde;o os dispositivos que realizam recep&ccedil;&atilde;o de dados e exibi&ccedil;&atilde;o de resultados para o usu&aacute;rio. Na maioria dos sistemas s&atilde;o relacionados com o teclado e o terminal (monitor), respectivamente, onde um dado programa &eacute; executado.</p>
      <p>Em seguida, aparece o chamado a mais uma diretiva de compila&ccedil;&atilde;o: a diretiva <span class="token">using</span>.</p>      
      <div class="informalexample">
	<pre class="programlisting"><strong class="hl-keyword">using</strong> <strong class="hl-keyword">namespace</strong> std;</pre>  
      </div>
      <p>Namespaces permitem ao usu&aacute;rio agrupar elementos de um programa sob a tutela de um nome (o namespace). Por exemplo, suponha que voc&ecirc; tivesse a disposi&ccedil;&atilde;o duas fun&ccedil;&otilde;es com o prot&oacute;tipo <code class="function">float media(float,float)</code>, mas com comportamentos diferentes. Uma delas calcula a m&eacute;dia aritm&eacute;tica, e a outra, a m&eacute;dia geom&eacute;trica. Para evitar reescrever o nome da fun&ccedil;&atilde;o, o uso de namespaces poderia servir para discriminar entre uma e outra. Por exemplo, <code class="function">Geometrica::media(3,3)</code> chamaria a fun&ccedil;&atilde;o m&eacute;dia no escopo do namespace <code class="literal">Geometrica</code>, e <code class="function">Aritmetica::media(3,3)</code> chamaria a fun&ccedil;&atilde;o m&eacute;dia implementada no escopo do namespace <code class="literal">Aritmetica</code>. . A diretiva <span class="token">using</span> serve para selecionar que namespace (ou subconjunto dele) dever&aacute; ser usado a partir da referida declara&ccedil;&atilde;o. As fun&ccedil;&otilde;es da biblioteca padr&atilde;o do C++ s&atilde;o todas declaradas no namespace <code class="literal">std</code>, da&iacute; a declara&ccedil;&atilde;o <span class="token">using namespace std;</span> estar presente na maioria dos c&oacute;digos desenvolvidos.</p>
      <p>Por enquanto, basta saber que o uso da chamada da declara&ccedil;&atilde;o acima evita que os nomes definidos no namespace <code class="literal">std</code> possam ser chamados sem usar o prefixo <code class="literal">std::</code>. Diversos elementos importantes para o usu&aacute;rio est&atilde;o definidos dentro desse namespace <code class="literal">std</code>, tais como os que permitem realizar entrada e sa&iacute;da de dados. Por isso, &eacute; bastante comum tal declara&ccedil;&atilde;o ser necess&aacute;ria na maioria dos programas em C++.</p>	
      <p>A fun&ccedil;&atilde;o <code class="function">main()</code> vem definida logo em seguida. Assim como em C, todo programa em C++ tamb&eacute;m inicia pelo chamado dessa fun&ccedil;&atilde;o. Sendo assim, apenas uma fun&ccedil;&atilde;o <code class="function">main()</code> &eacute; permitida por programa.</p>
      <div class="informalexample">
	<pre class="programlisting"><strong class="hl-keyword">int</strong> main(<strong class="hl-keyword">void</strong>){
...
}</pre>  
      </div>
      <p>As opera&ccedil;&otilde;es de entrada e sa&iacute;da de dados em C++ s&atilde;o bastante diferentes do que se costuma usar na linguagem de programa&ccedil;&atilde;o C. Em C, as fun&ccedil;&otilde;es de entrada e sa&iacute;da s&atilde;o <code class="function">printf()</code> e <code class="function">scanf()</code>, respectivamente. Em C++, duas entidades s&atilde;o usadas para desempenhar esse papel: <code class="literal">cin</code> e <code class="literal">cout</code>. No exemplo, encontra-se a seguinte declara&ccedil;&atilde;o:</p>
      <div class="informalexample">
	<pre class="programlisting">cout &lt;&lt; <strong class="hl-string"><em style="color:red">"Digite seu nome: "</em></strong>;</pre>  
      </div>
      <p>Quando executado, esse trecho de c&oacute;digo imprime na sa&iacute;da o literal <code class="computeroutput">"Digite seu nome:"</code>. Sem querer adiantar assunto que ser&aacute; apresentado no futuro, inevitavelmente &eacute; necess&aacute;rio apresentar <code class="literal">cout</code> como o objeto pr&eacute;-definido do namespace <code class="literal">std</code> respons&aacute;vel por receber vari&aacute;veis, format&aacute;-las e envi&aacute;-las para impress&atilde;o. O s&iacute;mbolo <span class="symbol"> &lt;&lt; </span> que aparece logo em seguida indica para onde o literal da direita est&aacute; sendo enviado. Neste caso, <code class="literal">cout</code>. Pelo fato de enviar elementos para <code class="literal">cout</code>, o s&iacute;mbolo <span class="symbol"> &lt;&lt; </span> &eacute; tamb&eacute;m conhecido como operador de inser&ccedil;&atilde;o.</p>
      <p>Embora o conceito de objeto s&oacute; seja apresentado mais adiante, n&atilde;o h&aacute; como apresentar os elementos que permitem ler e escrever sem tocar um m&iacute;nimo no assunto. Sendo assim, fica registrado que <code class="literal">cout</code> &eacute; um objeto que serve como ponte para enviar coisas ao terminal de sa&iacute;da. E quanto &agrave; fun&ccedil;&atilde;o <code class="function">printf()</code>? Tamb&eacute;m pode ser usada? Sim! Ela &eacute;, inclusive, mais r&aacute;pida para escrever que a solu&ccedil;&atilde;o usando <code class="literal">cout</code>. Entretanto, o uso do <code class="literal">cout</code> &eacute; menos propenso a erros, devendo ser preferido para programa&ccedil;&atilde;o em C++.</p>
      <p>Finalmente, as declara&ccedil;&otilde;es finais realizam a leitura de um literal digitado pelo usu&aacute;rio e reproduz o que foi lido na sa&iacute;da:</p>
      <div class="informalexample">
	<pre class="programlisting">cin &gt;&gt; s;
cout &lt;&lt; <strong class="hl-string"><em style="color:red">"Seu nome &eacute; "</em></strong> &lt;&lt; s &lt;&lt; endl;</pre>
      </div>
      <p>O s&iacute;mbolo <span class="symbol">endl</span> no final da declara&ccedil;&atilde;o equivale a uma quebra de linha, surtindo efeito semelhante ao uso do </p><pre class="programlisting"><strong class="hl-string"><em style="color:red">"\n"</em></strong></pre><p>.</p>
      <p>O objeto <code class="literal">cin</code> prop&otilde;e uma funcionalidade semelhante &agrave; do <code class="literal">cout</code>, mas destinado &agrave; entrada de dados. Ele normalmente &eacute; conectado &agrave; entrada padr&atilde;o (teclado) e as informa&ccedil;&otilde;es inseridas pelo usu&aacute;rios podem ser enviadas ao programa pelo operador de extra&ccedil;&atilde;o <span class="symbol">&gt;&gt;</span>, que aparece logo ap&oacute;s o <code class="literal">cin</code>.</p>
      <p>A prop&oacute;sito, os objetos <code class="literal">cin</code> e <code class="literal">cout</code> podem lidar com mais de um dado na mesma linha de declara&ccedil;&atilde;o, como ilustra a &uacute;ltima linha do exemplo anterior.</p>
    </div>
  </div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navfooter"><hr><table width="100%" class="navfoot" summary="Navigation footer"><tr><th width="40%" align="left"><a accesskey="p" class="navfoot" href="cha.introducao.html">&laquo;&nbsp;Cap&iacute;tulo 1. Introdu&ccedil;&atilde;o</a>&nbsp;</th><th width="20%" align="center"><a accesskey="h" class="navfoot" href="index.html">&#8657;Principal&#8657;</a></th><th width="40%" align="right">&nbsp;<a accesskey="n" class="navfoot" href="cha.classes.objetos.html">Cap&iacute;tulo 3.  Classes e objetos &nbsp;&raquo;</a></th></tr></table></div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navheader"><hr><table class="navfoot" width="100%"><tr><td align="center"><p class="copyright">Copyright &copy; 2012 Agostinho Brito</p></td></tr></table></div></body></html>